nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxw23/wireless_examples/pin_mux.c
    gpio_pin_config_t BUTTON1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_21 (pin 14)  */
    GPIO_PinInit(BOARD_INITPINS_BUTTON1_GPIO, BOARD_INITPINS_BUTTON1_PORT, BOARD_INITPINS_BUTTON1_PIN, &BUTTON1_config);

    const uint32_t RGB_GREEN = (/* Pin is configured as PIO0_0 */
                                IOCON_PIO_FUNC0 |
                                /* No addition pin function */
                                IOCON_PIO_MODE_INACT |
                                /* Standard mode, output slew rate control is enabled */
                                IOCON_PIO_SLEW_STANDARD |
                                /* Input function is not inverted */
                                IOCON_PIO_INV_DI |
                                /* Enables digital function */
                                IOCON_PIO_DIGITAL_EN |
                                /* Open drain is disabled */
                                IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN0 (coords: 31) is configured as PIO0_0 */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_RGB_GREEN_PORT, BOARD_INITPINS_RGB_GREEN_PIN, RGB_GREEN);

    const uint32_t RGB_RED = (/* Pin is configured as PIO0_1 */
                              IOCON_PIO_FUNC0 |
                              /* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Standard mode, output slew rate control is enabled */
                              IOCON_PIO_SLEW_STANDARD |
                              /* Input function is not inverted */
                              IOCON_PIO_INV_DI |
                              /* Enables digital function */
                              IOCON_PIO_DIGITAL_EN |
                              /* Open drain is disabled */
                              IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN1 (coords: 1) is configured as PIO0_1 */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_RGB_RED_PORT, BOARD_INITPINS_RGB_RED_PIN, RGB_RED);

    const uint32_t BUTTON0 = (/* Pin is configured as PIO0_18 */
                              IOCON_PIO_FUNC0 |
                              /* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Standard mode, output slew rate control is enabled */
                              IOCON_PIO_SLEW_STANDARD |
                              /* Input function is not inverted */
                              IOCON_PIO_INV_DI |
                              /* Enables digital function */
                              IOCON_PIO_DIGITAL_EN |
                              /* Open drain is disabled */
                              IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN18 (coords: 8) is configured as PIO0_18 */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_BUTTON0_PORT, BOARD_INITPINS_BUTTON0_PIN, BUTTON0);

#if defined(gAppUseSerialManager_c) && (gAppUseSerialManager_c > 1)
    /* Use pin 19 for UART prints */
      const uint32_t port0_pin19_config = (/* Pin is configured as FC2_TXD_SCL_MISO */
                                          IOCON_PIO_FUNC1 |
                                          /* No addition pin function */
                                          IOCON_PIO_MODE_INACT |
                                          /* Standard mode, output slew rate control is enabled */
                                          IOCON_PIO_SLEW_STANDARD |
                                          /* Input function is not inverted */
                                          IOCON_PIO_INV_DI |
                                          /* Enables digital function */
                                          IOCON_PIO_DIGITAL_EN |
                                          /* Open drain is disabled */
                                          IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN19 (coords: 7) is configured as FC2_TXD_SCL_MISO */
    IOCON_PinMuxSet(IOCON, 0U, 19U, port0_pin19_config);
#else
    /* Use pin 19 for blue LED */
    const uint32_t LED_BLUE = (/* Pin is configured as PIO0_19 */
                               IOCON_PIO_FUNC0 |
                               /* No addition pin function */
                               IOCON_PIO_MODE_INACT |
                               /* Standard mode, output slew rate control is enabled */
                               IOCON_PIO_SLEW_STANDARD |
                               /* Input function is not inverted */
                               IOCON_PIO_INV_DI |
                               /* Enables digital function */
                               IOCON_PIO_DIGITAL_EN |
                               /* Open drain is disabled */
                               IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN19 (coords: 7) is configured as PIO0_19 */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_LED_BLUE_PORT, BOARD_INITPINS_LED_BLUE_PIN, LED_BLUE);
#endif /* defined(gAppUseSerialManager_c) && (gAppUseSerialManager_c >= 1) */

    const uint32_t port0_pin2_config = (/* Pin is configured as FC0_RXD_SDA_MOSI */
                                        IOCON_PIO_FUNC1 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables digital function */
                                        IOCON_PIO_DIGITAL_EN |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN2 (coords: 2) is configured as FC0_RXD_SDA_MOSI */
    IOCON_PinMuxSet(IOCON, 0U, 2U, port0_pin2_config);

    const uint32_t BUTTON1 = (/* Pin is configured as PIO0_21 */
                              IOCON_PIO_FUNC0 |
                              /* No addition pin function */
                              IOCON_PIO_MODE_INACT |
                              /* Standard mode, output slew rate control is enabled */
                              IOCON_PIO_SLEW_STANDARD |
                              /* Input function is not inverted */
                              IOCON_PIO_INV_DI |
                              /* Enables digital function */
                              IOCON_PIO_DIGITAL_EN |
                              /* Open drain is disabled */
                              IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN21 (coords: 14) is configured as PIO0_21 */
    IOCON_PinMuxSet(IOCON, BOARD_INITPINS_BUTTON1_PORT, BOARD_INITPINS_BUTTON1_PIN, BUTTON1);

